In [1]:
import pandas as pd
import numpy as np
from sklearn.tree import DecisionTreeClassifier

In [2]:
DF = pd.read_csv('titanic.csv', index_col='PassengerId')
DF.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

In [23]:
DF=DF.drop(DF.columns[[ 2, 5,6,7,9,10]], axis=1)

In [16]:
DF['Pclass'][157]

3

In [24]:
DF.at[df['Sex']=='female','Sex']=0
DF.at[df['Sex']=='male','Sex']=1
DF.head()

             Survived  Pclass Sex  Age     Fare
PassengerId
1                   0       3   1   22   7.2500
2                   1       1   0   38  71.2833
3                   1       3   0   26   7.9250
4                   1       1   0   35  53.1000
5                   0       3   1   35   8.0500

In [25]:
DF.describe()

         Survived      Pclass         Age        Fare
count  891.000000  891.000000  714.000000  891.000000
mean     0.383838    2.308642   29.699118   32.204208
std      0.486592    0.836071   14.526497   49.693429
min      0.000000    1.000000    0.420000    0.000000
25%      0.000000    2.000000   20.125000    7.910400
50%      0.000000    3.000000   28.000000   14.454200
75%      1.000000    3.000000   38.000000   31.000000
max      1.000000    3.000000   80.000000  512.329200

In [27]:
DF.count(axis=0)

Survived    891
Pclass      891
Sex         891
Age         714
Fare        891
dtype: int64

In [28]:
DF.dropna(axis=0,inplace=True)
DF.count(axis=0)

Survived    714
Pclass      714
Sex         714
Age         714
Fare        714
dtype: int64

In [35]:
clf=DecisionTreeClassifier(random_state=241)
clf.fit(DF.drop('Survived',axis=1,inplace=False),DF.Survived)
importance_var=clf.feature_importances_

In [36]:
print(importance_var)

[ 0.14000522  0.30051221  0.2560461   0.30343647]